#### 📖 Terraform Plan ('infra-io/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.cgn_func_asp_01_autoscaler.module.function_app_autoscaler.data.azurerm_linux_function_app.function_apps["io-p-itn-cgn-card-func-02"]: Still reading... [10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.redis_cgn_02.azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-cgn-redis-02-private-endpoint"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-cgn-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "BusinessUnit"   = "CGN"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "io-p-itn-cgn-redis-02-private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-cgn-redis-02-private-service-connection"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "redisCache",
            ]
        }
    }

  # module.redis_cgn_02.azurerm_redis_cache.this will be created
  + resource "azurerm_redis_cache" "this" {
      + capacity                      = 1
      + enable_non_ssl_port           = false
      + family                        = "C"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "italynorth"
      + minimum_tls_version           = "1.2"
      + name                          = "io-p-itn-cgn-redis-02"
      + non_ssl_port_enabled          = (known after apply)
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = false
      + redis_version                 = "6"
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "io-p-itn-cgn-rg-01"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Standard"
      + ssl_port                      = (known after apply)
      + tags                          = {
          + "BusinessUnit"   = "CGN"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }

      + patch_schedule {
          + day_of_week        = "Sunday"
          + maintenance_window = "PT5H"
          + start_hour_utc     = 23
        }
      + patch_schedule {
          + day_of_week        = "Monday"
          + maintenance_window = "PT5H"
          + start_hour_utc     = 23
        }
      + patch_schedule {
          + day_of_week        = "Tuesday"
          + maintenance_window = "PT5H"
          + start_hour_utc     = 23
        }
      + patch_schedule {
          + day_of_week        = "Wednesday"
          + maintenance_window = "PT5H"
          + start_hour_utc     = 23
        }
      + patch_schedule {
          + day_of_week        = "Thursday"
          + maintenance_window = "PT5H"
          + start_hour_utc     = 23
        }

      + redis_configuration {
          + authentication_enabled                 = (known after apply)
          + data_persistence_authentication_method = "SAS"
          + enable_authentication                  = true
          + maxclients                             = (known after apply)
          + maxfragmentationmemory_reserved        = (known after apply)
          + maxmemory_delta                        = (known after apply)
          + maxmemory_policy                       = "volatile-lru"
          + maxmemory_reserved                     = (known after apply)
          + rdb_backup_enabled                     = false
        }
    }

  # module.cgn_func_asp_01_autoscaler.module.function_app_autoscaler.azurerm_monitor_autoscale_setting.this will be updated in-place
  ~ resource "azurerm_monitor_autoscale_setting" "this" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/autoScaleSettings/io-p-itn-cgn-func-as-01"
        name                = "io-p-itn-cgn-func-as-01"
      ~ tags                = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_app_service_plan_autoscaler"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.0.0"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions_cgn_card_02.module.function_app_cgn_card.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Web/sites/io-p-itn-cgn-card-func-02"
        name                                           = "io-p-itn-cgn-card-func-02"
      ~ tags                                           = {
            "BusinessUnit"                                   = "CGN"
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO CGN"
          + "ModuleName"                                     = "azure_function_app"
          + "ModuleSource"                                   = "DX"
          + "ModuleVersion"                                  = "0.3.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions_cgn_card_02.module.function_app_cgn_card.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Web/sites/io-p-itn-cgn-card-func-02/slots/staging"
        name                                           = "staging"
      ~ tags                                           = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (29 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_card_02.module.function_app_cgn_card.azurerm_monitor_metric_alert.function_app_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/metricAlerts/io-p-itn-cgn-card-func-02] Health Check Failed"
        name                     = "io-p-itn-cgn-card-func-02] Health Check Failed"
      ~ tags                     = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions_cgn_card_02.module.function_app_cgn_card.azurerm_monitor_metric_alert.storage_account_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/metricAlerts/[iopitncgncardstfn02] Low Availability"
        name                     = "[iopitncgncardstfn02] Low Availability"
      ~ tags                     = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions_cgn_card_02.module.function_app_cgn_card.azurerm_private_endpoint.function_sites will be updated in-place
  ~ resource "azurerm_private_endpoint" "function_sites" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-card-func-pep-02"
        name                          = "io-p-itn-cgn-card-func-pep-02"
      ~ tags                          = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_card_02.module.function_app_cgn_card.azurerm_private_endpoint.st_blob will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_blob" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-card-blob-pep-02"
        name                          = "io-p-itn-cgn-card-blob-pep-02"
      ~ tags                          = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_card_02.module.function_app_cgn_card.azurerm_private_endpoint.st_file will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_file" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-card-file-pep-02"
        name                          = "io-p-itn-cgn-card-file-pep-02"
      ~ tags                          = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_card_02.module.function_app_cgn_card.azurerm_private_endpoint.st_queue will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_queue" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-card-queue-pep-02"
        name                          = "io-p-itn-cgn-card-queue-pep-02"
      ~ tags                          = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_card_02.module.function_app_cgn_card.azurerm_private_endpoint.staging_function_sites[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "staging_function_sites" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-card-staging-func-pep-02"
        name                          = "io-p-itn-cgn-card-staging-func-pep-02"
      ~ tags                          = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_card_02.module.function_app_cgn_card.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
        id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncgncardstfn02"
        name                               = "iopitncgncardstfn02"
      ~ tags                               = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (97 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.functions_cgn_merchant_02.module.function_app_cgn_merchant.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Web/sites/io-p-itn-cgn-merchant-func-02"
        name                                           = "io-p-itn-cgn-merchant-func-02"
      ~ tags                                           = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions_cgn_merchant_02.module.function_app_cgn_merchant.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Web/sites/io-p-itn-cgn-merchant-func-02/slots/staging"
        name                                           = "staging"
      ~ tags                                           = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (29 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_merchant_02.module.function_app_cgn_merchant.azurerm_monitor_metric_alert.function_app_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/metricAlerts/io-p-itn-cgn-merchant-func-02] Health Check Failed"
        name                     = "io-p-itn-cgn-merchant-func-02] Health Check Failed"
      ~ tags                     = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions_cgn_merchant_02.module.function_app_cgn_merchant.azurerm_monitor_metric_alert.storage_account_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/metricAlerts/[iopitncgnmerchantstfn02] Low Availability"
        name                     = "[iopitncgnmerchantstfn02] Low Availability"
      ~ tags                     = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions_cgn_merchant_02.module.function_app_cgn_merchant.azurerm_private_endpoint.function_sites will be updated in-place
  ~ resource "azurerm_private_endpoint" "function_sites" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-merchant-func-pep-02"
        name                          = "io-p-itn-cgn-merchant-func-pep-02"
      ~ tags                          = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_merchant_02.module.function_app_cgn_merchant.azurerm_private_endpoint.st_blob will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_blob" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-merchant-blob-pep-02"
        name                          = "io-p-itn-cgn-merchant-blob-pep-02"
      ~ tags                          = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_merchant_02.module.function_app_cgn_merchant.azurerm_private_endpoint.st_file will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_file" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-merchant-file-pep-02"
        name                          = "io-p-itn-cgn-merchant-file-pep-02"
      ~ tags                          = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_merchant_02.module.function_app_cgn_merchant.azurerm_private_endpoint.st_queue will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_queue" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-merchant-queue-pep-02"
        name                          = "io-p-itn-cgn-merchant-queue-pep-02"
      ~ tags                          = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_merchant_02.module.function_app_cgn_merchant.azurerm_private_endpoint.staging_function_sites[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "staging_function_sites" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-merchant-staging-func-pep-02"
        name                          = "io-p-itn-cgn-merchant-staging-func-pep-02"
      ~ tags                          = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_merchant_02.module.function_app_cgn_merchant.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
        id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncgnmerchantstfn02"
        name                               = "iopitncgnmerchantstfn02"
      ~ tags                               = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (97 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.functions_cgn_search_02.module.function_app_cgn_search.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Web/sites/io-p-itn-cgn-search-func-02"
        name                                           = "io-p-itn-cgn-search-func-02"
      ~ tags                                           = {
            "BusinessUnit"                                   = "CGN"
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO CGN"
          + "ModuleName"                                     = "azure_function_app"
          + "ModuleSource"                                   = "DX"
          + "ModuleVersion"                                  = "0.3.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions_cgn_search_02.module.function_app_cgn_search.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Web/sites/io-p-itn-cgn-search-func-02/slots/staging"
        name                                           = "staging"
      ~ tags                                           = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (29 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_search_02.module.function_app_cgn_search.azurerm_monitor_metric_alert.function_app_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/metricAlerts/io-p-itn-cgn-search-func-02] Health Check Failed"
        name                     = "io-p-itn-cgn-search-func-02] Health Check Failed"
      ~ tags                     = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions_cgn_search_02.module.function_app_cgn_search.azurerm_monitor_metric_alert.storage_account_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/metricAlerts/[iopitncgnsearchstfn02] Low Availability"
        name                     = "[iopitncgnsearchstfn02] Low Availability"
      ~ tags                     = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions_cgn_search_02.module.function_app_cgn_search.azurerm_private_endpoint.function_sites will be updated in-place
  ~ resource "azurerm_private_endpoint" "function_sites" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-search-func-pep-02"
        name                          = "io-p-itn-cgn-search-func-pep-02"
      ~ tags                          = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_search_02.module.function_app_cgn_search.azurerm_private_endpoint.st_blob will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_blob" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-search-blob-pep-02"
        name                          = "io-p-itn-cgn-search-blob-pep-02"
      ~ tags                          = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_search_02.module.function_app_cgn_search.azurerm_private_endpoint.st_file will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_file" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-search-file-pep-02"
        name                          = "io-p-itn-cgn-search-file-pep-02"
      ~ tags                          = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_search_02.module.function_app_cgn_search.azurerm_private_endpoint.st_queue will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_queue" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-search-queue-pep-02"
        name                          = "io-p-itn-cgn-search-queue-pep-02"
      ~ tags                          = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_search_02.module.function_app_cgn_search.azurerm_private_endpoint.staging_function_sites[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "staging_function_sites" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-search-staging-func-pep-02"
        name                          = "io-p-itn-cgn-search-staging-func-pep-02"
      ~ tags                          = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_search_02.module.function_app_cgn_search.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
        id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncgnsearchstfn02"
        name                               = "iopitncgnsearchstfn02"
      ~ tags                               = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (97 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.functions_cgn_support_01.module.function_app_cgn_support.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change. The value is unchanged.
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Web/sites/io-p-itn-cgn-support-func-01"
        name                                           = "io-p-itn-cgn-support-func-01"
      ~ tags                                           = {
            "BusinessUnit"                                   = "CGN"
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO CGN"
          + "ModuleName"                                     = "azure_function_app"
          + "ModuleSource"                                   = "DX"
          + "ModuleVersion"                                  = "0.3.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions_cgn_support_01.module.function_app_cgn_support.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change. The value is unchanged.
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Web/sites/io-p-itn-cgn-support-func-01/slots/staging"
        name                                           = "staging"
      ~ tags                                           = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (29 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_support_01.module.function_app_cgn_support.azurerm_monitor_metric_alert.function_app_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/metricAlerts/io-p-itn-cgn-support-func-01] Health Check Failed"
        name                     = "io-p-itn-cgn-support-func-01] Health Check Failed"
      ~ tags                     = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions_cgn_support_01.module.function_app_cgn_support.azurerm_monitor_metric_alert.storage_account_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/metricAlerts/[iopitncgnsupportstfn01] Low Availability"
        name                     = "[iopitncgnsupportstfn01] Low Availability"
      ~ tags                     = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions_cgn_support_01.module.function_app_cgn_support.azurerm_private_endpoint.function_sites will be updated in-place
  ~ resource "azurerm_private_endpoint" "function_sites" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-support-func-pep-01"
        name                          = "io-p-itn-cgn-support-func-pep-01"
      ~ tags                          = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_support_01.module.function_app_cgn_support.azurerm_private_endpoint.st_blob will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_blob" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-support-blob-pep-01"
        name                          = "io-p-itn-cgn-support-blob-pep-01"
      ~ tags                          = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_support_01.module.function_app_cgn_support.azurerm_private_endpoint.st_file will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_file" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-support-file-pep-01"
        name                          = "io-p-itn-cgn-support-file-pep-01"
      ~ tags                          = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_support_01.module.function_app_cgn_support.azurerm_private_endpoint.st_queue will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_queue" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-support-queue-pep-01"
        name                          = "io-p-itn-cgn-support-queue-pep-01"
      ~ tags                          = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_support_01.module.function_app_cgn_support.azurerm_private_endpoint.staging_function_sites[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "staging_function_sites" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-support-staging-func-pep-01"
        name                          = "io-p-itn-cgn-support-staging-func-pep-01"
      ~ tags                          = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_support_01.module.function_app_cgn_support.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
        id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncgnsupportstfn01"
        name                               = "iopitncgnsupportstfn01"
      ~ tags                               = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (97 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 2 to add, 41 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.redis_cgn.azurerm_redis_cache.this,
  on .terraform/modules/redis_cgn/redis_cache/main.tf line 7, in resource "azurerm_redis_cache" "this":
   7:   enable_non_ssl_port           = var.enable_non_ssl_port

`enable_non_ssl_port` will be removed in favour of the property
`non_ssl_port_enabled` in version 4.0 of the AzureRM Provider.

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
